In [1]:
##importing the libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
## loading the data
data=pd.read_csv('loan_approved.csv')

In [3]:
## Getting the first few rows of data
data.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status (Approved)
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [4]:
data.Gender.value_counts()

Gender
Male      489
Female    112
Name: count, dtype: int64

In [5]:
# head,tail,info,describe for both numerical and categorical
data.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [6]:
data.describe(include='O')

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status (Approved)
count,614,601,611,599,614,582,614,614
unique,614,2,2,4,2,2,3,2
top,LP002990,Male,Yes,0,Graduate,No,Semiurban,Y
freq,1,489,398,345,480,500,233,422

In [7]:
print(f"{data.columns[0]} is not so used")
print(f"{data.columns[1]} is Nominal")
print(f"{data.columns[2]} is Nominal")
print(f"{data.columns[3]} is Ordinal")
print(f"{data.columns[4]} is Nominal")
print(f"{data.columns[5]} is Nominal")
print(f"{data.columns[6]} is Discrete")
print(f"{data.columns[7]} is Continuous")
print(f"{data.columns[8]} is Continuous")
print(f"{data.columns[9]} is Continuous")
print(f"{data.columns[10]} is Nominal")
print(f"{data.columns[11]} is Nominal")

Loan_ID is not so used
Gender is Nominal
Married is Nominal
Dependents is Ordinal
Education is Nominal
Self_Employed is Nominal
ApplicantIncome is Discrete
CoapplicantIncome is Continuous
LoanAmount is Continuous
Loan_Amount_Term is Continuous
Credit_History is Nominal
Property_Area is Nominal

In [8]:
# fill the missing values with central tendancy

for i in data.columns:    
    if data[i].dtype in ['int64','float64']:      
        if data[i].isnull().sum() > 0:      
            data[i] = data[i].fillna(data[i].median())
    else:                                         
        if data[i].isnull().sum() > 0:
            data[i] = data[i].fillna(data[i].mode()[0])

data.isnull().sum()

Loan_ID                   0
Gender                    0
Married                   0
Dependents                0
Education                 0
Self_Employed             0
ApplicantIncome           0
CoapplicantIncome         0
LoanAmount                0
Loan_Amount_Term          0
Credit_History            0
Property_Area             0
Loan_Status (Approved)    0
dtype: int64

# Outlier Detection

In [9]:
mean_data = data['ApplicantIncome'].mean()
data['ApplicantIncome'].fillna(mean_data, inplace=True)

sd = data['ApplicantIncome'].std()

print("Standard Deviation is:", sd)
print("Mean is:", mean_data)

z1 = (5849 - mean_data)/ sd
print("Z-score is:", z1)

Standard Deviation is: 6109.041673387174
Mean is: 5403.459283387622
Z-score is: 0.07293135984867927

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10112\3545690776.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['ApplicantIncome'].fillna(mean_data, inplace=True)

In [ ]:
# maximum value of appicant column